In [100]:
from urllib.parse import quote
encoded_password = quote("Mubeen@12345", safe="")
connection_string = f"mysql+pymysql://sweeterror404:{encoded_password}@localhost:3306/mubeen"
%load_ext sql
%sql $connection_string

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [101]:
import mysql.connector
db = mysql.connector.connect(
    host="127.0.0.1",
    port="3306",
    user="sweeterror404", 
    password="Mubeen@12345",
    database='mubeen')

def query(command):
    global db 
    db.connect()
    cursor = db.cursor()
    cursor.execute(command)
    return cursor

def calling_func(name,arg):
    import pandas as pd
    db.connect()
    cursor = db.cursor(dictionary=True)
    data = pd.DataFrame()
    try:
        result = cursor.callproc(name, arg)
        
        for row in cursor.stored_results():
            for record in row.fetchall():            
                data = pd.concat([data,pd.DataFrame([record])])
    
    except mysql.connector.Error as err:
        print(f"Error: {err}")
        print(f"SQL Statement: {cursor.statement}")
    finally:
        cursor.close()
        db.close()
    data = data.reset_index().drop(columns='index')
    return data

<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">Handler
</h1>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
In MySQL, a handler is a mechanism used to deal with specific conditions or errors that may occur during the execution of a stored procedure or a block of code. <br><br>Handlers allow you to define how your code should respond to different situations, such as errors, warnings, or exceptions.<br><br>There are different types of handlers based on the types of conditions they handle
</div>


<img style="display: block;margin-left: auto;margin-right: auto;width: 60%; " src="./sql_images/handler.png"><br><br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<ul><li>SQLSTATE</li>
<ul><li>These handlers catch errors based on SQLSTATE values, which represent the standard SQL error codes.</li><li>In SQLSTATE we Required Expection Code</li></ul></ul>
</div>

<br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Here i create a table all sqlstate error_codes
</div>

In [3]:
%sql SELECT * FROM sql_state_er LIMIT 10

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
10 rows affected.

[('1002', 'HY000', 'Message: NO'),
 ('1003', 'HY000', 'Message: YES'),
 ('1004', 'HY000', "Message: Can't create file '%s' (errno: %d - %s)"),
 ('1005', 'HY000', "Message: Can't create table '%s' (errno: %d - %s)"),
 ('1006', 'HY000', "Message: Can't create database '%s' (errno: %d - %s)"),
 ('1007', 'HY000', "Message: Can't create database '%s' database exists"),
 ('1008', 'HY000', "Message: Can't drop database '%s' database doesn't exist"),
 ('1010', 'HY000', "Message: Error dropping database (can't rmdir '%s', errno: %d -"),
 ('1012', 'HY000', "Message: Can't read record in system table"),
 ('1013', 'HY000', "Message: Can't get status of '%s' (errno: %d - %s)")]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
For Example
</div>

In [4]:
%sql SELECT * FROM laptop_bk LIMIT 1

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(1, 'Apple', 'Ultrabook', Decimal('13.3'), 2560, 1600, 0, 1, 'Intel', 'Core i5', Decimal('2.3'), 8, 'SSD', 128, 0, 'Intel', ' Iris Plus Graphics 640', 'Mac', Decimal('1.4'), Decimal('71379.0'))]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Now i try to select ids instead of id
</div>

In [5]:
%sql SELECT ids FROM laptop_bk LIMIT 1

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
(pymysql.err.OperationalError) (1054, "Unknown column 'ids' in 'field list'")
[SQL: SELECT ids FROM laptop_bk LIMIT 1]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Here 1054 is a sqlstate Error<br><br>lets check in error table</div>

In [6]:
%sql SELECT * FROM sql_state_er WHERE error_code = 1054

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[('1054', '42S22', "Message: Unknown column '%s' in '%s'")]

In [7]:
%%sql
CREATE PROCEDURE sql_st_1()
BEGIN

	DECLARE CONTINUE HANDLER FOR SQLSTATE '42S22' -- Exception code number
    BEGIN
		SELECT 'Error Exception' AS ErrorMessage;
    END;

	SELECT idss FROM laptop_bk;

END;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [8]:
%sql call sql_st_1();

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[('Error Exception',)]

In [9]:
%sql DROP PROCEDURE sql_st_1;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Example 2</div>

In [10]:
%%sql
DROP TABLE users;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [11]:
%%sql
CREATE TABLE users (
    id INT PRIMARY KEY AUTO_INCREMENT,
    username VARCHAR(50) NOT NULL,
    email VARCHAR(100) UNIQUE NOT NULL
);

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [12]:
%%sql
INSERT INTO users(username,email)
VALUES ('mubeen111','mubeen111@xyz.com')

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[]

In [13]:
%sql SELECT * FROM users;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(1, 'mubeen111', 'mubeen111@xyz.com')]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Enter Duplicate email</div>

In [14]:
%%sql
INSERT INTO users(username,email)
VALUES ('mubeen22',sess = tf.Session(config=tf.ConfigProto(log_device_placement=True))'mubeen111@xyz.com')

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
(pymysql.err.IntegrityError) (1062, "Duplicate entry 'mubeen111@xyz.com' for key 'users.email'")
[SQL: INSERT INTO users(username,email)
VALUES ('mubeen22','mubeen111@xyz.com')]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [15]:
%sql SELECT * FROM sql_state_er WHERE error_code = 1062

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[('1062', '23000', "Message: Duplicate entry '%s' for key %d")]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Duplicate Error Exception code is 23000</div>

In [18]:
%%sql
CREATE PROCEDURE insert_data(IN usr_name VARCHAR(255), IN user_email VARCHAR(255))
BEGIN
    DECLARE CONTINUE HANDLER FOR SQLSTATE '23000'
    BEGIN
        SELECT 'Error: Duplicate entry for email.';
    END;

    INSERT INTO users (username, email) VALUES (usr_name, user_email);
    SELECT * FROM users;

END;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [19]:
%sql CALL insert_data('mubeen222','mubeen222@xyz.com')

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
2 rows affected.

[(1, 'mubeen111', 'mubeen111@xyz.com'), (3, 'mubeen222', 'mubeen222@xyz.com')]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Now Enter Duplicate email</div>

In [20]:
%sql CALL insert_data('mubeen','mubeen222@xyz.com')

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[('Error: Duplicate entry for email.',)]

In [21]:
%sql SELECT * FROM users;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
2 rows affected.

[(1, 'mubeen111', 'mubeen111@xyz.com'), (3, 'mubeen222', 'mubeen222@xyz.com')]

In [22]:
%sql DROP PROCEDURE insert_data;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Now Insert Data in Bulk<br><br> Create Procedure</div>

In [23]:
%%sql

CREATE PROCEDURE insert_data(IN str VARCHAR(255),IN sep VARCHAR(5))
BEGIN
        DECLARE start_pos INT DEFAULT 1;
        DECLARE end_pos INT DEFAULT 1;

        w_loop : WHILE 1 DO

            
            SET end_pos = LOCATE(sep,str,start_pos);
            
            IF end_pos = 0 THEN 
                LEAVE w_loop;
            END IF;

            -- code

            
            SET @string = SUBSTRING(str,start_pos,end_pos - start_pos);
            SET @user_name = substring_index(@string,"|",1);
            SET @user_email = substring_index(@string,"|",-1);

            -- code 
            
            SET start_pos = end_pos + 1;

            SELECT @user_name,@user_email;
            
        END WHILE w_loop; 
END;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [24]:
calling_func('insert_data',('user1|email1,user2|email2,user3|email3,user4|email4,',','))

  @user_name @user_email
0      user1      email1
1      user2      email2
2      user3      email3
3      user4      email4

In [26]:
%sql SELECT * FROM users;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
2 rows affected.

[(1, 'mubeen111', 'mubeen111@xyz.com'), (3, 'mubeen222', 'mubeen222@xyz.com')]

In [47]:
%sql DROP PROCEDURE insert_data;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Now insert data in table</div>

In [48]:
%%sql

CREATE PROCEDURE insert_data(IN str VARCHAR(255),IN sep VARCHAR(5))
BEGIN
        DECLARE start_pos INT DEFAULT 1;
        DECLARE end_pos INT DEFAULT 1;

        DECLARE string VARCHAR(255);
        DECLARE user_name VARCHAR(255);
        DECLARE user_email VARCHAR(255);


        w_loop : WHILE 1 DO

            
            SET end_pos = LOCATE(sep,str,start_pos);
            
            IF end_pos = 0 THEN 
                LEAVE w_loop;
            END IF;

            -- code

            
            SET string = SUBSTRING(str,start_pos,end_pos - start_pos);
            SET user_name = substring_index(string,"|",1);
            SET user_email = substring_index(string,"|",-1);
    
            INSERT INTO users (username, email) VALUES (user_name, user_email);
            -- code 
            
            SET start_pos = end_pos + 1;

            
        END WHILE w_loop; 
END;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [51]:
%sql CALL insert_data('rizwan212|rizwan123@abc.com,aliahmad234|aliahmad234@gmail.com,shahzad11|shahzad11@xyz.com,',',')

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Here only add unique Data</div>

In [91]:
%sql SELECT * FROM users;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
6 rows affected.

[(1, 'mubeen111', 'mubeen111@xyz.com'),
 (3, 'mubeen222', 'mubeen222@xyz.com'),
 (26, 'rizwan212', 'rizwan123@abc.com'),
 (27, 'aliahmad234', 'aliahmad234@gmail.com'),
 (28, 'shahzad11', 'shahzad11@xyz.com'),
 (37, 'unqiue1', 'unique1@xyz.com')]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Now try to add first duplicate email</div>

In [53]:
%sql CALL insert_data('rizwan212|rizwan123@abc.com,unqiue1|unique1@xyz.com,',',')

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
(pymysql.err.IntegrityError) (1062, "Duplicate entry 'rizwan123@abc.com' for key 'users.email'")
[SQL: CALL insert_data('rizwan212|rizwan123@abc.com,unqiue1|unique1@xyz.com,',',')]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [54]:
%sql SELECT * FROM users;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
5 rows affected.

[(1, 'mubeen111', 'mubeen111@xyz.com'),
 (3, 'mubeen222', 'mubeen222@xyz.com'),
 (26, 'rizwan212', 'rizwan123@abc.com'),
 (27, 'aliahmad234', 'aliahmad234@gmail.com'),
 (28, 'shahzad11', 'shahzad11@xyz.com')]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Here unique1 data are not entered due to previous duplicate entry error<br> SO here we need to use raise the Error</div>

In [57]:
%sql SELECT * FROM sql_state_er WHERE error_code = 1062;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[('1062', '23000', "Message: Duplicate entry '%s' for key %d")]

In [79]:
%sql DROP PROCEDURE insert_data;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [88]:
%%sql

CREATE PROCEDURE insert_data(IN str VARCHAR(255),IN sep VARCHAR(5))
BEGIN

        DECLARE start_pos INT DEFAULT 1;
        DECLARE end_pos INT DEFAULT 1;

        DECLARE string VARCHAR(255);
        DECLARE user_name VARCHAR(255);
        DECLARE user_email VARCHAR(255);

        DECLARE CONTINUE HANDLER FOR SQLSTATE '23000'
        BEGIN
            SELECT user_name,user_email, "Data are note Insert" AS Duplicate_Entry;
        END;
        
        w_loop : WHILE 1 DO

            
            SET end_pos = LOCATE(sep,str,start_pos);
            
            IF end_pos = 0 THEN 
                LEAVE w_loop;
            END IF;

            -- code

            SET string = SUBSTRING(str,start_pos,end_pos - start_pos);
            SET user_name = substring_index(string,"|",1);
            SET user_email = substring_index(string,"|",-1);

            INSERT INTO users (username, email) VALUES (user_name, user_email);

            -- code 
            
            SET start_pos = end_pos + 1;

            
        END WHILE w_loop; 
END;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [89]:
%sql CALL insert_data('rizwan212|rizwan123@abc.com,unqiue1|unique1@xyz.com,',',')

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[('rizwan212', 'rizwan123@abc.com', 'Data are note Insert')]

In [90]:
%sql SELECT * FROM users

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
6 rows affected.

[(1, 'mubeen111', 'mubeen111@xyz.com'),
 (3, 'mubeen222', 'mubeen222@xyz.com'),
 (26, 'rizwan212', 'rizwan123@abc.com'),
 (27, 'aliahmad234', 'aliahmad234@gmail.com'),
 (28, 'shahzad11', 'shahzad11@xyz.com'),
 (37, 'unqiue1', 'unique1@xyz.com')]

In [92]:
%sql DROP PROCEDURE insert_data;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<ul><li>SQLEXCEPTION</li>
<ul><li>These handlers are triggered when a SQL exception occurs, such as a runtime error during the execution of a stored procedure.</li><li>Here we DOnt Required Expection Code</li><li>Only Required Get DIAGNOSTICS for access Error message</li></li></ul></ul>
</div>

In [93]:
%sql SELECT * FROM laptop_bk LIMIT 1

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(1, 'Apple', 'Ultrabook', Decimal('13.3'), 2560, 1600, 0, 1, 'Intel', 'Core i5', Decimal('2.3'), 8, 'SSD', 128, 0, 'Intel', ' Iris Plus Graphics 640', 'Mac', Decimal('1.4'), Decimal('71379.0'))]

In [94]:
%sql SELECT ids FROM laptop_bk LIMIT 1

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
(pymysql.err.OperationalError) (1054, "Unknown column 'ids' in 'field list'")
[SQL: SELECT ids FROM laptop_bk LIMIT 1]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">now use SQLEXCEPTION
</div>

In [116]:
%%sql

CREATE PROCEDURE sql_exp()
BEGIN

    DECLARE err_msg VARCHAR(255);
    DECLARE CONTINUE HANDLER FOR SQLEXCEPTION
    BEGIN
        GET DIAGNOSTICS CONDITION 1     -- use_for access error message 
        err_msg = MESSAGE_TEXT;
    END;

    SELECT idss FROM laptop_bk;
    SELECT err_msg AS error_message;
END;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
    <ul><li>When you use "GET DIAGNOSTICS CONDITION 1" inside a CONTINUE HANDLER FOR SQLEXCEPTION, you can store details of the exception in variables like MESSAGE_TEXT.</li></ul><ul><li>MESSAGE_TEXT is a predefined variable that, when used with the GET DIAGNOSTICS statement, stores the text message associated with a SQL exception.</li><br><ul><li>It captures the error message generated when a SQL operation fails. You can then use this variable according to your needs, such as logging the error, reporting, or taking other actions based on the exception. It helps in handling runtime exceptions effectively.</li></ul></ul>
    <ul><li>The meaning of "GET DIAGNOSTICS CONDITION 1" is that when a SQL exception (such as SQLEXCEPTION) occurs, you can obtain diagnostic information through this statement. "CONDITION 1" indicates that we want diagnostic information for the first exception.</li></ul>
</div>

In [117]:
%sql CALL sql_exp()

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[("Unknown column 'idss' in 'field list'",)]

In [118]:
%sql DROP PROCEDURE sql_exp;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [119]:
%sql SELECT * FROM users;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
6 rows affected.

[(1, 'mubeen111', 'mubeen111@xyz.com'),
 (3, 'mubeen222', 'mubeen222@xyz.com'),
 (26, 'rizwan212', 'rizwan123@abc.com'),
 (27, 'aliahmad234', 'aliahmad234@gmail.com'),
 (28, 'shahzad11', 'shahzad11@xyz.com'),
 (37, 'unqiue1', 'unique1@xyz.com')]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Example 2 : Enter Duplicates and use SQLEXCEPTION</div>

In [133]:
%%sql

CREATE PROCEDURE insert_data(IN str VARCHAR(255),IN sep VARCHAR(5))
BEGIN

        DECLARE start_pos INT DEFAULT 1;
        DECLARE end_pos INT DEFAULT 1;

        DECLARE string VARCHAR(255);
        DECLARE user_name VARCHAR(255);
        DECLARE user_email VARCHAR(255);

        DECLARE error VARCHAR(255);

        DECLARE CONTINUE HANDLER FOR SQLEXCEPTION
        BEGIN
            GET DIAGNOSTICS CONDITION 1
            error = MESSAGE_TEXT;
            SELECT error;
        END;

        w_loop : WHILE 1 DO

            
            SET end_pos = LOCATE(sep,str,start_pos);
            
            IF end_pos = 0 THEN 
                LEAVE w_loop;
            END IF;

            -- code

            SET string = SUBSTRING(str,start_pos,end_pos - start_pos);
            SET user_name = substring_index(string,"|",1);
            SET user_email = substring_index(string,"|",-1);

            INSERT INTO users (username, email) VALUES (user_name, user_email);
            

            -- code 
            
            SET start_pos = end_pos + 1;

            
        END WHILE w_loop; 
END;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [134]:
%sql CALL insert_data('unqiue1|unique1@xyz.com,unqiue2|unique2@xyz.com,',',')

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[("Duplicate entry 'unique1@xyz.com' for key 'users.email'",)]

In [135]:
%sql SELECT * FROM users;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
7 rows affected.

[(1, 'mubeen111', 'mubeen111@xyz.com'),
 (3, 'mubeen222', 'mubeen222@xyz.com'),
 (26, 'rizwan212', 'rizwan123@abc.com'),
 (27, 'aliahmad234', 'aliahmad234@gmail.com'),
 (28, 'shahzad11', 'shahzad11@xyz.com'),
 (37, 'unqiue1', 'unique1@xyz.com'),
 (42, 'unqiue2', 'unique2@xyz.com')]

In [136]:
%sql DROP PROCEDURE insert_data;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<ul><li>Value Error</li>
<ul><li>In Sql State we Required Exception Error Value But in Value Error we just Pass a Error Value</li></ul></ul>
</div>

In [137]:
%sql SELECT ids FROM laptop_bk LIMIT 1

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
(pymysql.err.OperationalError) (1054, "Unknown column 'ids' in 'field list'")
[SQL: SELECT ids FROM laptop_bk LIMIT 1]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Here 1054 is Value Error and Exception code is 23000 but we direct pass 1054 for Raise the Error
</div>

In [147]:
%%sql

CREATE PROCEDURE sql_value_err()
BEGIN

    DECLARE CONTINUE HANDLER FOR 1054
    BEGIN
        SELECT 'Unknown column' AS error_message;
    END;

    SELECT idss FROM laptop_bk;
END;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [148]:
%sql CALL sql_value_err();

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[('Unknown column',)]

In [149]:
%sql DROP PROCEDURE sql_value_err;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Note we also use GET DIAGNOSTICS also
</div>

In [150]:
%%sql

CREATE PROCEDURE sql_value_err()
BEGIN
        DECLARE error VARCHAR(255);

        DECLARE CONTINUE HANDLER FOR 1054
        BEGIN
            GET DIAGNOSTICS CONDITION 1
            error = MESSAGE_TEXT;
            SELECT error;
        END;

    SELECT idss FROM laptop_bk;
END;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [151]:
%sql CALL sql_value_err();

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[("Unknown column 'idss' in 'field list'",)]

In [152]:
%sql DROP PROCEDURE sql_value_err;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<ul><li>SQLWARNING</li><br>
<ul><li>Show Warning Messages</li></ul><li>Unfortunately Due to Bug in Mysql SQLWARNING Handler are not working</li></ul>
</div>
<hr>

<br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<ul><li>NOT FOUND</li><br>
<ul><li>Used with cursors, these handlers deal with the condition when no more rows are found during cursor fetching.</li></ul>
</div>

In [70]:
%sql SELECT * FROM laptop_bk LIMIT 1

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(1, 'Apple', 'Ultrabook', Decimal('13.3'), 2560, 1600, 0, 1, 'Intel', 'Core i5', Decimal('2.3'), 8, 'SSD', 128, 0, 'Intel', ' Iris Plus Graphics 640', 'Mac', Decimal('1.4'), Decimal('71379.0'))]

In [77]:
%sql SELECT COUNT(*) FROM laptop_bk

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(1242,)]

In [149]:
%%sql

CREATE PROCEDURE iter_count()
BEGIN

    DECLARE i INT DEFAULT 1;
    DECLARE _id INT;
    DECLARE _company VARCHAR(255);

    DECLARE cur CURSOR FOR (SELECT id,Company FROM laptop_bk);

    OPEN cur;

    WHILE i <= 1242 DO
        FETCH cur INTO _id,_company;
        SELECT _id,_company;
        SET i = i + 1;
    END WHILE;
    CLOSE cur;

END;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [150]:
calling_func('iter_count',())

       _id _company
0        1    Apple
1        2    Apple
2        3       HP
3        4    Apple
4        5    Apple
...    ...      ...
1237  1238     Asus
1238  1239   Lenovo
1239  1240   Lenovo
1240  1241   Lenovo
1241  1242       HP

[1242 rows x 2 columns]

In [151]:
%sql DROP PROCEDURE iter_count;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

<br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Here i use cursor for iterate all rows <br>But  i use last no of row for brake the loop <br><br>So here we also use NOT FOUND Handler</div>

In [159]:
%%sql

CREATE PROCEDURE iter_count()
BEGIN

    DECLARE _id INT;
    DECLARE _company VARCHAR(255);

    DECLARE cursor_finished INT DEFAULT 0;
    DECLARE cur CURSOR FOR (SELECT id,Company FROM laptop_bk);

    DECLARE CONTINUE HANDLER FOR NOT FOUND
    BEGIN
        SET cursor_finished = 1;
    END;

    OPEN cur;

    my_loop: LOOP
        FETCH cur INTO _id,_company;

        IF cursor_finished = 1 THEN
            LEAVE my_loop;
        END IF;

    SELECT _id,_company;
    
    END LOOP my_loop;

    CLOSE cur;

END;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [160]:
calling_func("iter_count",())

       _id _company
0        1    Apple
1        2    Apple
2        3       HP
3        4    Apple
4        5    Apple
...    ...      ...
1237  1238     Asus
1238  1239   Lenovo
1239  1240   Lenovo
1240  1241   Lenovo
1241  1242       HP

[1242 rows x 2 columns]

In [161]:
%sql DROP PROCEDURE iter_count;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]